app/views/questions/index.html.erb

                        <u>Rep:</u>
                        <%= (question.get_upvotes.size -  question.get_downvotes.size) %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."question_id" = $1  [["question_id", 1]]

                    <u>Answers</u> <br>
                    <%= question.answers.count %>
---
SELECT "answers".* FROM "answers" WHERE (content || tags  ilike '%FIRST%')
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]