app/views/users/index.html.erb

	        <div class="user-index-questions col-xs-1 col-sm-offset-1">
	        	<%= link_to user.questions.count, user %>
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = $1  [["user_id", 1]]

	        <div class="user-index-answers col-xs-1">
	        	<%= link_to user.answers.count, user %>
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."user_id" = $1  [["user_id", 1]]

	        <div class="user-index-votes col-xs-2 col-sm-1">
	        	<%= link_to user.votes.count, user %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."user_id" = $1  [["user_id", 1]]