app/views/users/show.html.erb

                            <div class="bg-w-border" style="overflow:hidden;">
                                <%=  @user.questions.count %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = $1  [["user_id", 1]]

                            <div class="bg-w-border" style="overflow:hidden;">
                                <%=  @user.answers.count %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."user_id" = $1  [["user_id", 1]]


                    <% if !@user.questions.empty? %>
---
SELECT  1 AS one FROM "questions" WHERE "questions"."user_id" = $1 LIMIT 1  [["user_id", 1]]

                        <br>
                        <%= (question.get_upvotes.size -  question.get_downvotes.size) %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."question_id" = $1  [["question_id", 1]]


                <% if !question.answers.empty? %>
---
SELECT  1 AS one FROM "answers" WHERE "answers"."user_id" = $1 LIMIT 1  [["user_id", 1]]

                    <div class="tag-grouping">
                        <% answer.question.tags.split.to_a.each do |single_tag|%>
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]

                        <br>
                        <%= (answer.get_upvotes.size -  answer.get_downvotes.size) %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."answer_id" = $1  [["answer_id", 1]]