app/views/answers/_form.html.erb

            <div class="content-column-tags">
                <% answer.question.tags.split.to_a.each do |tag| %>
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]