app/views/answers/show.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."answer_id" = $1  [["answer_id", 1]]
---
				<strong>
					Votes: <%= answer.votes.count %>