app/controllers/answers_controller.rb

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
        @answer = Answer.find(params[:id])