app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE (title || content || tags  ilike '%FIRST%')  ORDER BY votes desc
SELECT "answers".* FROM "answers" WHERE (content || tags  ilike '%FIRST%')
---
	def index
		@questions = Question.all
		@answers = Answer.all