app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "ryan@ryan.com"]]
---
	def user_login
		if params[:email].present? && User.where(email: params[:email]).take